{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "d799e93c",
   "metadata": {},
   "source": [
    "# **Trabajo Integrador Base de Datos**\n",
    "En el siguiente trabajo modelaremos un Sistema de Gestión y Recomendación de Viajes a través de distintas bases de datos. Logrando cumplir los siguientes objetivos:\n",
    "* Almacenar información de usuarios, historial de reservas, destinos turísticos, hoteles, actividades disponibles y precios asociados. \n",
    "* Gestionar datos temporales como búsquedas recientes o reservas en proceso. \n",
    "* Relaciones de conocimeinto entre usuarios, relaciones de usuarios y destinos. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "8014fcb6",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "from pymongo import MongoClient\n",
    "import redis\n",
    "\n",
    "driver = GraphDatabase.driver(\"bolt://neo4j:7687\", auth=(\"neo4j\", NEO4J_PASSWORD))\n",
    "client = MongoClient(f\"mongodb://{MONGO_USER}:{MONGO_PASS}@mongo:27017/\")\n",
    "r = redis.Redis(host=\"redis\", port=6379, password=REDIS_PASSWORD, decode_responses=True)\n",
    "\n",
    "session=driver.session()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "86b7407b",
   "metadata": {},
   "source": [
    "## **Se realiza la carga de datos**"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "140d3651",
   "metadata": {},
   "source": [
    "### Usuarios:\n",
    "Usando MongoDB los definimos a los \"usuarios\" con \"id_usuario\", \"nombre\", \"email\" y \"teléfono\". Para ello creamos una base de datos, la colección usuarios y definimos diversos documentos. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "e99f8f13",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "InsertManyResult([ObjectId('68f52be4bc856d8bff8f7217'), ObjectId('68f52be4bc856d8bff8f7218'), ObjectId('68f52be4bc856d8bff8f7219'), ObjectId('68f52be4bc856d8bff8f721a'), ObjectId('68f52be4bc856d8bff8f721b'), ObjectId('68f52be4bc856d8bff8f721c'), ObjectId('68f52be4bc856d8bff8f721d'), ObjectId('68f52be4bc856d8bff8f721e'), ObjectId('68f52be4bc856d8bff8f721f'), ObjectId('68f52be4bc856d8bff8f7220'), ObjectId('68f52be4bc856d8bff8f7221'), ObjectId('68f52be4bc856d8bff8f7222'), ObjectId('68f52be4bc856d8bff8f7223'), ObjectId('68f52be4bc856d8bff8f7224'), ObjectId('68f52be4bc856d8bff8f7225'), ObjectId('68f52be4bc856d8bff8f7226'), ObjectId('68f52be4bc856d8bff8f7227'), ObjectId('68f52be4bc856d8bff8f7228'), ObjectId('68f52be4bc856d8bff8f7229'), ObjectId('68f52be4bc856d8bff8f722a')], acknowledged=True)"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.usuarios.insert_many ([\n",
    "    {\"id_usuario\": 1, \"nombre\": \"Lucrecia Martínez Pastur\", \"email\": \"lucreciapastur@gmail.com\", \"telefono\": \"+54 2901587087\"},\n",
    "    {\"id_usuario\": 2, \"nombre\": \"Rocio Coccaro\", \"email\": \"rociococcaro@gmail.com\", \"telefono\": \"+54 221701563\"},\n",
    "    {\"id_usuario\": 3, \"nombre\": \"Gregorio Gonzalez\", \"email\": \"gregz@gmail.com\", \"telefono\": \"+54 2901444243\"},\n",
    "    {\"id_usuario\": 4, \"nombre\": \"Isabela Rodriguez\", \"email\": \"isarod@gmail.com\", \"telefono\": \"+54 011546321\"},\n",
    "    {\"id_usuario\": 5, \"nombre\": \"Conrado Maris\", \"email\": \"conramaris@gmail.com\", \"telefono\": \"+54 383512789\"},\n",
    "    {\"id_usuario\": 6, \"nombre\": \"Delfina Gomez\", \"email\": \"delfinag@gmail.com\", \"telefono\": \"+54 011459891\"},\n",
    "    {\"id_usuario\": 7, \"nombre\": \"Guillermo Juarez\", \"email\": \"gjuarez@gmail.com\", \"telefono\": \"+54 362461597\"},\n",
    "    {\"id_usuario\": 8, \"nombre\": \"Ema Fernandez\", \"email\": \"emmafer@gmail.com\", \"telefono\": \"+54 280421542\"},\n",
    "    {\"id_usuario\": 9, \"nombre\": \"Benjamin Alvarez\", \"email\": \"benja123@gmail.com\", \"telefono\": \"+54 351497625\"},\n",
    "    {\"id_usuario\": 10, \"nombre\": \"Olivia Lopez\", \"email\": \"olivia999@gmail.com\", \"telefono\": \"+54 343959599\"},\n",
    "    {\"id_usuario\": 11, \"nombre\": \"Mateo Sosa\", \"email\": \"tomasmate@gmail.com\", \"telefono\": \"+54 2954454447\"},\n",
    "    {\"id_usuario\": 12, \"nombre\": \"Emilia Martinez\", \"email\": \"emimarti@gmail.com\", \"telefono\": \"+54 380789454\"},\n",
    "    {\"id_usuario\": 13, \"nombre\": \"Lorenzo Torres\", \"email\": \"loretorre@gmail.com\", \"telefono\": \"+54 376855419\"},\n",
    "    {\"id_usuario\": 14, \"nombre\": \"Valentina Diaz\", \"email\": \"valendiaz@gmail.com\", \"telefono\": \"+54 299494644\"},\n",
    "    {\"id_usuario\": 15, \"nombre\": \"Joaquin Ruiz\", \"email\": \"joacoruiz@gmail.com\", \"telefono\": \"+54 2920131651\"},\n",
    "    {\"id_usuario\": 16, \"nombre\": \"Martina Sanchez\", \"email\": \"martis@gmail.com\", \"telefono\": \"+54 264484615\"},\n",
    "    {\"id_usuario\": 17, \"nombre\": \"Santino Ramirez\", \"email\": \"santinorami@gmail.com\", \"telefono\": \"+54 266947546\"},\n",
    "    {\"id_usuario\": 18, \"nombre\": \"Catalina Romero\", \"email\": \"catarome@gmail.com\", \"telefono\": \"+54 385491913\"},\n",
    "    {\"id_usuario\": 19, \"nombre\": \"Juan Flores\", \"email\": \"juanflor@gmail.com\", \"telefono\": \"+54 2901642731\"},\n",
    "    {\"id_usuario\": 20, \"nombre\": \"Sofia Hernandez\", \"email\": \"sofiher@gmail.com\", \"telefono\": \"+54 385060540\"}\n",
    "])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3f97fbe7",
   "metadata": {},
   "source": [
    "### Destinos:\n",
    "Usando MongoDB los definimos con un id_destino, ciudad, provincia, país, un tipo (que puede ser: cosera, lacustre, ribereña, urbana, llanura, serrana, montaña, cuyana), y un precio promedio. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "65f9c649",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "InsertManyResult([ObjectId('68f52be6bc856d8bff8f722b'), ObjectId('68f52be6bc856d8bff8f722c'), ObjectId('68f52be6bc856d8bff8f722d'), ObjectId('68f52be6bc856d8bff8f722e'), ObjectId('68f52be6bc856d8bff8f722f'), ObjectId('68f52be6bc856d8bff8f7230'), ObjectId('68f52be6bc856d8bff8f7231'), ObjectId('68f52be6bc856d8bff8f7232'), ObjectId('68f52be6bc856d8bff8f7233'), ObjectId('68f52be6bc856d8bff8f7234'), ObjectId('68f52be6bc856d8bff8f7235'), ObjectId('68f52be6bc856d8bff8f7236'), ObjectId('68f52be6bc856d8bff8f7237'), ObjectId('68f52be6bc856d8bff8f7238'), ObjectId('68f52be6bc856d8bff8f7239'), ObjectId('68f52be6bc856d8bff8f723a'), ObjectId('68f52be6bc856d8bff8f723b'), ObjectId('68f52be6bc856d8bff8f723c'), ObjectId('68f52be6bc856d8bff8f723d'), ObjectId('68f52be6bc856d8bff8f723e')], acknowledged=True)"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.destinos.insert_many([\n",
    "    {\"id_destino\": 1, \"ciudad\": \"Ushuaia\", \"provincia\": \"Tierra del Fuego\", \"pais\": \"Argentina\", \"tipo\": \"Montaña\", \"precio_promedio\": 150000},\n",
    "    {\"id_destino\": 2, \"ciudad\": \"Calafate\", \"provincia\": \"Santa Cruz\", \"pais\": \"Argentina\", \"tipo\": \"Lacustre\", \"precio_promedio\": 120000},\n",
    "    {\"id_destino\": 3, \"ciudad\": \"El Chalten\", \"provincia\": \"Santa Cruz\", \"pais\": \"Argentina\", \"tipo\": \"Montaña\", \"precio_promedio\": 700000},\n",
    "    {\"id_destino\": 4, \"ciudad\": \"Puerto Madrin\", \"provincia\": \"Chubut\", \"pais\": \"Argentina\", \"tipo\": \"Costera\", \"precio_promedio\": 90000},\n",
    "    {\"id_destino\": 5, \"ciudad\": \"Bariloche\", \"provincia\": \"Rio Negro\", \"pais\": \"Argentina\", \"tipo\": \"Montaña\", \"precio_promedio\": 130000},\n",
    "    {\"id_destino\": 6, \"ciudad\": \"San Martin de los Andes\", \"provincia\": \"Neuquen\", \"pais\": \"Argentina\", \"tipo\": \"Montaña\", \"precio_promedio\": 110000},\n",
    "    {\"id_destino\": 7, \"ciudad\": \"San Rafael\", \"provincia\": \"Mendoza\", \"pais\": \"Argentina\", \"tipo\": \"Serrana\", \"precio_promedio\": 120000},\n",
    "    {\"id_destino\": 8, \"ciudad\": \"Mendoza\", \"provincia\": \"Mendoza\", \"pais\": \"Argentina\", \"tipo\": \"Serrana\", \"precio_promedio\": 106000},\n",
    "    {\"id_destino\": 9, \"ciudad\": \"Cordoba\", \"provincia\": \"Cordoba\", \"pais\": \"Argentina\", \"tipo\": \"Urbana\", \"precio_promedio\": 130000},\n",
    "    {\"id_destino\": 10, \"ciudad\": \"Villa General Belgrano\", \"provincia\": \"Cordoba\", \"pais\": \"Argentina\", \"tipo\": \"Serrana\", \"precio_promedio\": 130000},\n",
    "    {\"id_destino\": 11, \"ciudad\": \"Buenos Aires\", \"provincia\": \"Buenos Aires\", \"pais\": \"Argentina\", \"tipo\": \"Urbana\", \"precio_promedio\": 90000},\n",
    "    {\"id_destino\": 12, \"ciudad\": \"La Plata\", \"provincia\": \"Buenos Aires\", \"pais\": \"Argentina\", \"tipo\": \"Urbana\", \"precio_promedio\": 70000},\n",
    "    {\"id_destino\": 13, \"ciudad\": \"Mar del Plata\", \"provincia\": \"Buenos Aires\", \"pais\": \"Argentina\", \"tipo\": \"Costera\", \"precio_promedio\": 90000},\n",
    "    {\"id_destino\": 14, \"ciudad\": \"Monte Hermoso\", \"provincia\": \"Buenos Aires\", \"pais\": \"Argentina\", \"tipo\": \"Costera\", \"precio_promedio\": 80000},\n",
    "    {\"id_destino\": 15, \"ciudad\": \"Tandil\", \"provincia\": \"Buenos Aires\", \"pais\": \"Argentina\", \"tipo\": \"Llanura\", \"precio_promedio\": 100000},\n",
    "    {\"id_destino\": 16, \"ciudad\": \"Bahía Blanca\", \"provincia\": \"Buenos Aires\", \"pais\": \"Argentina\", \"tipo\": \"Urbana\", \"precio_promedio\": 80000},\n",
    "    {\"id_destino\": 17, \"ciudad\": \"Gualeguaychu\", \"provincia\": \"Entre Rios\", \"pais\": \"Argentina\", \"tipo\": \"Ribereña\", \"precio_promedio\": 70000},\n",
    "    {\"id_destino\": 18, \"ciudad\": \"Puerto Iguazu\", \"provincia\": \"Misiones\", \"pais\": \"Argentina\", \"tipo\": \"Ribereña\", \"precio_promedio\": 90000},\n",
    "    {\"id_destino\": 19, \"ciudad\": \"San Miguel de Tucuman\", \"provincia\": \"Tucuman\", \"pais\": \"Argentina\", \"tipo\": \"Llanura\", \"precio_promedio\": 60000},\n",
    "    {\"id_destino\": 20, \"ciudad\": \"Tilcara\", \"provincia\": \"Jujuy\", \"pais\": \"Argentina\", \"tipo\": \"Llanura\", \"precio_promedio\": 105000},\n",
    "])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5fd8ff92",
   "metadata": {},
   "source": [
    "### Hoteles:\n",
    "Usando MongoDB los definimos con un id_hotel, nombre, precio, clasificación, y servicios (que pueden ser: wifi, desayuno, restaurante, áreas comunes, estacionamiento, entretenimeinto, pileta y gimnasio). "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "061efc38",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "InsertManyResult([ObjectId('68f52be8bc856d8bff8f723f'), ObjectId('68f52be8bc856d8bff8f7240'), ObjectId('68f52be8bc856d8bff8f7241'), ObjectId('68f52be8bc856d8bff8f7242'), ObjectId('68f52be8bc856d8bff8f7243'), ObjectId('68f52be8bc856d8bff8f7244'), ObjectId('68f52be8bc856d8bff8f7245'), ObjectId('68f52be8bc856d8bff8f7246'), ObjectId('68f52be8bc856d8bff8f7247'), ObjectId('68f52be8bc856d8bff8f7248'), ObjectId('68f52be8bc856d8bff8f7249'), ObjectId('68f52be8bc856d8bff8f724a'), ObjectId('68f52be8bc856d8bff8f724b'), ObjectId('68f52be8bc856d8bff8f724c'), ObjectId('68f52be8bc856d8bff8f724d'), ObjectId('68f52be8bc856d8bff8f724e'), ObjectId('68f52be8bc856d8bff8f724f'), ObjectId('68f52be8bc856d8bff8f7250'), ObjectId('68f52be8bc856d8bff8f7251'), ObjectId('68f52be8bc856d8bff8f7252'), ObjectId('68f52be8bc856d8bff8f7253'), ObjectId('68f52be8bc856d8bff8f7254'), ObjectId('68f52be8bc856d8bff8f7255'), ObjectId('68f52be8bc856d8bff8f7256'), ObjectId('68f52be8bc856d8bff8f7257'), ObjectId('68f52be8bc856d8bff8f7258'), ObjectId('68f52be8bc856d8bff8f7259'), ObjectId('68f52be8bc856d8bff8f725a'), ObjectId('68f52be8bc856d8bff8f725b'), ObjectId('68f52be8bc856d8bff8f725c'), ObjectId('68f52be8bc856d8bff8f725d'), ObjectId('68f52be8bc856d8bff8f725e'), ObjectId('68f52be8bc856d8bff8f725f'), ObjectId('68f52be8bc856d8bff8f7260'), ObjectId('68f52be8bc856d8bff8f7261'), ObjectId('68f52be8bc856d8bff8f7262'), ObjectId('68f52be8bc856d8bff8f7263'), ObjectId('68f52be8bc856d8bff8f7264'), ObjectId('68f52be8bc856d8bff8f7265'), ObjectId('68f52be8bc856d8bff8f7266'), ObjectId('68f52be8bc856d8bff8f7267'), ObjectId('68f52be8bc856d8bff8f7268'), ObjectId('68f52be8bc856d8bff8f7269'), ObjectId('68f52be8bc856d8bff8f726a')], acknowledged=True)"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.hoteles.insert_many([\n",
    "    {\"id_hotel\": 1, \"nombre\": \"Arakur\", \"ciudad\": \"Ushuaia\", \"precio\": 375000, \"calificacion\": 5, \"servicios\": [\"wifi\", \"desayuno\", \"restaurante\", \"areas comunes\", \"estacionamiento\", \"entretenimiento\", \"pileta\", \"gimnasio\"]},\n",
    "    {\"id_hotel\": 2, \"nombre\": \"Los Cauquenes\", \"ciudad\": \"Ushuaia\", \"precio\": 260000, \"calificacion\": 5, \"servicios\": [\"wifi\", \"desayuno\", \"restaurante\", \"areas comunes\", \"estacionamiento\", \"entretenimiento\", \"pileta\", \"gimnasio\"]},\n",
    "    {\"id_hotel\": 3, \"nombre\": \"Las Lengas\", \"ciudad\": \"Ushuaia\", \"precio\": 116000, \"calificacion\": 3, \"servicios\": [\"wifi\", \"desayuno\", \"restaurante\", \"estacionamiento\"]},\n",
    "    {\"id_hotel\": 4, \"nombre\": \"Kalken\", \"ciudad\": \"Calafate\", \"precio\": 144000, \"calificacion\": 3, \"servicios\": [\"wifi\", \"desayuno\", \"areas comunes\", \"estacionamiento\"]},\n",
    "    {\"id_hotel\": 5, \"nombre\": \"Chalten Suites Hotel\", \"ciudad\": \"El Chalten\", \"precio\": 168000, \"calificacion\": 3, \"servicios\": [\"wifi\", \"desayuno\", \"areas comunes\", \"estacionamiento\"]},\n",
    "    {\"id_hotel\": 6, \"nombre\": \"Hesperia Cordoba\", \"ciudad\": \"Cordoba\", \"precio\": 250000, \"calificacion\": 4, \"servicios\": [\"wifi\", \"desayuno\", \"restaurante\", \"areas comunes\", \"estacionamiento\", \"entretenimiento\", \"pileta\", \"gimnasio\"]},\n",
    "    {\"id_hotel\": 7, \"nombre\": \"Eurostars Palace\", \"ciudad\": \"Cordoba\", \"precio\": 300000, \"calificacion\": 5, \"servicios\": [\"wifi\", \"desayuno\", \"restaurante\", \"areas comunes\", \"estacionamiento\", \"entretenimiento\", \"pileta\", \"gimnasio\"]},\n",
    "    {\"id_hotel\": 8, \"nombre\": \"Hotel Yvera Cataratas\", \"ciudad\": \"Puerto Iguazu\", \"precio\": 75000, \"calificacion\": 3, \"servicios\": [\"wifi\", \"desayuno\", \"pileta\", \"estacionamiento\"]},\n",
    "    {\"id_hotel\": 9, \"nombre\": \"Hotel Saint George\", \"ciudad\": \"Puerto Iguazu\", \"precio\": 325000, \"calificacion\": 4, \"servicios\": [\"wifi\", \"desayuno\", \"areas comunes\", \"pileta\"]},\n",
    "    {\"id_hotel\": 10, \"nombre\": \"Overo Lodge & Selva\", \"ciudad\": \"Puerto Iguazu\", \"precio\": 500000, \"calificacion\": 5, \"serticios\": [\"wifi\", \"desayuno\", \"restaurante\", \"areas comunes\", \"estacionamiento\", \"entretenimiento\", \"pileta\", \"gimnasio\"]},\n",
    "    {\"id_hotel\": 11, \"nombre\": \"Huinid Bustillo Hotel & Spa\", \"ciudad\": \"Bariloche\", \"precio\": 205000, \"calificacion\": 4, \"servicios\": [\"wifi\", \"desayuno\", \"restaurante\", \"areas comunes\", \"estacionamiento\", \"pileta\", \"gimnasio\"]},\n",
    "    {\"id_hotel\": 12, \"nombre\": \"Monasterio Hotel Boutique\", \"ciudad\": \"Bariloche\", \"precio\": 115000, \"calificacion\": 3, \"servicios\": [\"wifi\", \"desayuno\", \"areas comunes\", \"estacionamiento\", \"pileta\", \"gimnasio\"]},\n",
    "    {\"id_hotel\": 13, \"nombre\": \"Torres al Mar\", \"ciudad\": \"Monte Hermoso\", \"precio\": 125000, \"calificacion\": 4, \"servicios\": [\"wifi\", \"estacionamiento\"]},\n",
    "    {\"id_hotel\": 14, \"nombre\": \"Hotel Aguay\", \"ciudad\": \"Gualeguaychu\", \"precio\": 113000, \"calificacion\": 4, \"servicios\": [\"wifi\", \"desayuno\", \"areas comunes\", \"estacionameinto\", \"pileta\"]},\n",
    "    {\"id_hotel\": 16, \"nombre\": \"Hotel Puerto A\", \"ciudad\": \"Gualeguaychu\", \"precio\": 115000, \"calificacion\": 2, \"servicios\": [\"wifi\", \"desayuno\"]},\n",
    "    {\"id_hotel\": 17, \"nombre\": \"Balconcito de Tilcara\", \"ciudad\": \"Tilcara\", \"precio\": 50000, \"calificacion\": 3, \"servicios\": [\"wifi\"]}, \n",
    "    {\"id_hotel\": 18, \"nombre\": \"Hotel Belgrano\", \"ciudad\": \"Tilcara\", \"precio\": 95000, \"calificacion\": 2, \"servicios\": [\"wifi\", \"restaurante\"]}, \n",
    "    {\"id_hotel\": 19, \"nombre\": \"Vientonorte\", \"ciudad\": \"Tilcara\", \"precio\": 170000, \"calificacion\": 3, \"servicios\": [\"wifi\", \"desayuno\", \"restaurante\", \"pileta\"]},\n",
    "    {\"id_hotel\": 20, \"nombre\": \"Ritz Hotel Mendoza\", \"ciudad\": \"Mendoza\", \"precio\": 100000, \"calificacion\": 3, \"servicios\": [\"wifi\", \"desayuno\", \"estacionamiento\",]},\n",
    "    {\"id_hotel\": 21, \"nombre\": \"Casa Agostino - Luxury wine resort\", \"ciudad\": \"Mendoza\", \"precio\": 405000, \"calificacion\": 4, \"servicios\": [\"wifi\", \"desayuno\", \"restaurante\", \"areas comunes\", \"estacionamiento\", \"pileta\", \"gimnasio\"]},\n",
    "    {\"id_hotel\": 22, \"nombre\": \"Agua del Corral Hotel & Spa\", \"ciudad\": \"Mendoza\", \"precio\": 150000, \"calificacion\": 4, \"servicios\": [\"wifi\", \"desayuno\", \"restaurante\",]},\n",
    "    {\"id_hotel\": 23, \"nombre\": \"Hotel Tower Inn & Suites\", \"ciudad\": \"San Rafael\", \"precio\": 111000, \"calificacion\": 4, \"servicios\": [\"wifi\", \"desayuno\", \"estacionamiento\", \"gimnasio\", \"areas comunes\"]},\n",
    "    {\"id_hotel\": 24, \"nombre\": \"San Martin Hotel & Spa\", \"ciudad\": \"San Rafael\", \"precio\": 100000, \"calificacion\": 3, \"servicios\": [\"wifi\", \"desayuno\", \"restaurante\", \"gimnasio\"]},\n",
    "    {\"id_hotel\": 25, \"nombre\": \"Suter Petit Hotel\", \"ciudad\": \"San Rafael\", \"precio\": 260000, \"calificacion\": 4, \"servicios\": [\"wifi\", \"desayuno\", \"estacionamiento\", \"gimnasio\", \"areas comunes\", \"entretenimeiento\"]},\n",
    "    {\"id_hotel\": 27, \"nombre\": \"Dazzler by Wyndham La Plata\", \"ciudad\": \"La Plata\", \"precio\": 178850, \"calificacion\": 4, \"servicios\": [\"wifi\", \"desayuno\", \"restaurante\", \"estacionamiento\", \"gimnasio\", \"entretenimeinto\"]},\n",
    "    {\"id_hotel\": 28, \"nombre\": \"San Marco Hotel\", \"ciudad\": \"La Plata\", \"precio\": 91000, \"calificacion\": 3, \"servicios\": [\"wifi\", \"desayuno\", \"estacionamiento\"]},\n",
    "    {\"id_hotel\": 29, \"nombre\": \"Hotel del Sol\", \"ciudad\": \"La Plata\", \"precio\": 160000, \"calificacion\": 3, \"servicios\": [\"wifi\", \"desayuno\", \"estacionamiento\", \"gimnasio\"]},\n",
    "    {\"id_hotel\": 30, \"nombre\": \"Hotel Spa Republica\", \"ciudad\": \"Mar del Plata\", \"precio\": 227000, \"calificacion\": 4, \"servicios\": [\"wifi\", \"desayuno\", \"restaurante\", \"gimnasio\", \"entretenimiento\", \"estacionamiento\"]},\n",
    "    {\"id_hotel\": 31, \"nombre\": \"Grand Hotel Skorpios\", \"ciudad\": \"Mar del Plata\", \"precio\": 95000, \"calificacion\": 3, \"servicios\": [\"wifi\", \"desayuno\"]},\n",
    "    {\"id_hotel\": 32, \"nombre\": \"Hotel Las Rocas\", \"ciudad\": \"Mar del Plata\", \"precio\": 150000, \"calificacion\": 4, \"servicios\": [\"wifi\", \"desayuno\", \"restaurante\", \"gimnasio\", \"entretenimiento\", \"estacionamiento\"]},\n",
    "    {\"id_hotel\": 33, \"nombre\": \"Howard Johnson Hotel & Casino\", \"ciudad\": \"Villa General Belgrano\", \"precio\": 160000, \"calificacion\": 4, \"servicios\": [\"wifi\", \"desayuno\", \"estacionamiento\", \"gimnasio\", \"restaurante\", \"entretenimiento\", \"partes comunes\", \"pileta\"]},\n",
    "    {\"id_hotel\": 34, \"nombre\": \"Aldea de los Pajaros\", \"ciudad\": \"Villa General Belgrano\", \"precio\": 122000, \"calificacion\": 3, \"servicios\": [\"wifi\", \"desayuno\", \"estacionamiento\", \"entretenimiento\", \"pileta\"]},\n",
    "    {\"id_hotel\": 35, \"nombre\": \"Hotel Argos\", \"ciudad\": \"Bahia Blanca\", \"precio\": 255000, \"calificacion\": 4, \"servicios\": [\"wifi\", \"desayuno\", \"restaurante\", \"gimnasio\"]},\n",
    "    {\"id_hotel\": 36, \"nombre\": \"Sofia Soberana Hotel Boutique\", \"ciudad\": \"Bahia Blanca\", \"precio\": 360000, \"calificacion\": 5, \"servicios\": [\"wifi\", \"desayuno\", \"estacionamiento\"]},\n",
    "    {\"id_hotel\": 37, \"nombre\": \"Hotel & Spa La Cheminee\", \"ciudad\" : \"San Martin de los Andes\", \"precio\": 355000, \"calificacion\": 3, \"servicios\": [\"wifi\", \"desayuno\", \"restaurante\", \"estacionameinto\", \"entretenimeinto\"]},\n",
    "    {\"id_hotel\": 38, \"nombre\": \"Amonite Apart & Spa\", \"ciudad\": \"San Martin de los Andes\", \"precio\": 260000, \"calificacion\": 3, \"servicios\": [\"wifi\", \"desayuno\", \"pileta\", \"estacionamiento\", \"pileta\"]},\n",
    "    {\"id_hotel\": 39, \"nombre\": \"Posada La Protegida\", \"ciudad\": \"Tandil\", \"precio\": 200000, \"calificacion\": 3, \"servicios\": [\"wifi\", \"desayuno\", \"estacionamiento\", \"restaurante\", \"gimnasio\", \"entretenimiento\", \"pileta\"]},\n",
    "    {\"id_hotel\": 40, \"nombre\": \"Amaike Hotel Golf & Spa\", \"ciudad\": \"Tandil\", \"precio\": 260000, \"calificacion\": 4, \"servicios\": [\"wifi\", \"desayuno\", \"estacionamiento\", \"restaurante\", \"gimnasio\", \"pileta\", \"partes comunes\"]},\n",
    "    {\"id_hotel\": 41, \"nombre\": \"Rayentray Grand Hotel\", \"ciudad\": \"Puerto Madryn\", \"precio\": 250000, \"calificacion\": 4, \"servicios\": [\"wifi\", \"desayuno\", \"gimnasio\", \"estacionameinto\", \"entretenimiento\", \"pileta\", \"restaurante\"]},\n",
    "    {\"id_hotel\": 42, \"nombre\": \"Patagonia Apart Hotel\", \"ciudad\": \"Puerto Madryn\", \"precio\": 130000, \"calificacion\": 3, \"servicios\": [\"wifi\", \"desayuno\", \"estacionamiento\"]},\n",
    "    {\"id_hotel\": 43, \"nombre\": \"Krista Boutique Hotel\", \"ciudad\": \"Buenos Aires\", \"precio\": 550000, \"calificacion\": 4, \"servicios\": [\"wifi\", \"desayuno\", \"estacionamiento\", \"gimnasio\", \"pileta\", \"partes comunes\", \"entretenimiento\"]},\n",
    "    {\"id_hotel\": 44, \"nombre\": \"Hotel Centro Naval\", \"ciudad\": \"Buenos Aires\", \"precio\": 150000, \"calificacion\": 3, \"servicios\": [\"Wifi\", \"desayuno\" ]},\n",
    "    {\"id_hotel\": 45, \"nombre\": \"Hotel Carlos V\", \"ciudad\": \"San Miguel de Tucuman\", \"precio\": 110000, \"calificacion\": 3, \"servicios\": [\"wifi\", \"desayuno\", \"restaurante\"]},\n",
    "    {\"id_hotel\": 46, \"nombre\": \"Hilton Garden Inn Tucuman\", \"ciudad\": \"San Miguel de Tucuman\", \"precio\": 155000, \"calificaicon\": 4, \"servicios\": [\"wifi\", \"desayuno\", \"restaurante\", \"estacionamiento\", \"gimnasio\", \"entretenimiento\", \"partes comunes\"]} \n",
    "])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8ddbeea5",
   "metadata": {},
   "source": [
    "### Actividades:\n",
    "Usando MongoDB las definimos con un id_actividad, nombre, tipo (que puede ser: aventura, cultural, treking, gastronomico, recreativo, informativo o bienestar), ciudad y precio. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "6ebb3d65",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "InsertManyResult([ObjectId('68f52bebbc856d8bff8f726b'), ObjectId('68f52bebbc856d8bff8f726c'), ObjectId('68f52bebbc856d8bff8f726d'), ObjectId('68f52bebbc856d8bff8f726e'), ObjectId('68f52bebbc856d8bff8f726f'), ObjectId('68f52bebbc856d8bff8f7270'), ObjectId('68f52bebbc856d8bff8f7271'), ObjectId('68f52bebbc856d8bff8f7272'), ObjectId('68f52bebbc856d8bff8f7273'), ObjectId('68f52bebbc856d8bff8f7274'), ObjectId('68f52bebbc856d8bff8f7275'), ObjectId('68f52bebbc856d8bff8f7276'), ObjectId('68f52bebbc856d8bff8f7277'), ObjectId('68f52bebbc856d8bff8f7278'), ObjectId('68f52bebbc856d8bff8f7279'), ObjectId('68f52bebbc856d8bff8f727a'), ObjectId('68f52bebbc856d8bff8f727b'), ObjectId('68f52bebbc856d8bff8f727c'), ObjectId('68f52bebbc856d8bff8f727d'), ObjectId('68f52bebbc856d8bff8f727e'), ObjectId('68f52bebbc856d8bff8f727f'), ObjectId('68f52bebbc856d8bff8f7280'), ObjectId('68f52bebbc856d8bff8f7281'), ObjectId('68f52bebbc856d8bff8f7282'), ObjectId('68f52bebbc856d8bff8f7283'), ObjectId('68f52bebbc856d8bff8f7284'), ObjectId('68f52bebbc856d8bff8f7285'), ObjectId('68f52bebbc856d8bff8f7286'), ObjectId('68f52bebbc856d8bff8f7287'), ObjectId('68f52bebbc856d8bff8f7288'), ObjectId('68f52bebbc856d8bff8f7289'), ObjectId('68f52bebbc856d8bff8f728a'), ObjectId('68f52bebbc856d8bff8f728b'), ObjectId('68f52bebbc856d8bff8f728c'), ObjectId('68f52bebbc856d8bff8f728d'), ObjectId('68f52bebbc856d8bff8f728e'), ObjectId('68f52bebbc856d8bff8f728f'), ObjectId('68f52bebbc856d8bff8f7290'), ObjectId('68f52bebbc856d8bff8f7291'), ObjectId('68f52bebbc856d8bff8f7292'), ObjectId('68f52bebbc856d8bff8f7293'), ObjectId('68f52bebbc856d8bff8f7294'), ObjectId('68f52bebbc856d8bff8f7295'), ObjectId('68f52bebbc856d8bff8f7296'), ObjectId('68f52bebbc856d8bff8f7297'), ObjectId('68f52bebbc856d8bff8f7298')], acknowledged=True)"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.actividades.insert_many([\n",
    "    {\"id_actividad\": 1, \"nombre\": \"Visita al Museo Maritimo y ex presidio de Ushuaia\", \"tipo\": \"Cultural\", \"ciudad\": \"Ushuaia\", \"precio\": 10000},\n",
    "    {\"id_actividad\": 2, \"nombre\": \"Navegacion a la pinguinera\", \"tipo\": \"Aventura\", \"ciudad\": \"Ushuaia\", \"precio\": 150000},\n",
    "    {\"id_actividad\": 3, \"nombre\": \"Treking a la Laguna Esmeralda\", \"tipo\": \"Treking\", \"ciudad\": \"Ushuaia\", \"precio\": 50000},\n",
    "    {\"id_actividad\": 4, \"nombre\": \"Navegacion junto al glaciar Perito Moreno\", \"tipo\": \"Aventura\", \"ciudad\": \"Calafate\", \"precio\": 100000},\n",
    "    {\"id_actividad\": 5, \"nombre\": \"Caminata sobre el glaciar Perito Moreno\", \"tipo\": \"Aventura\", \"ciudad\": \"Calafate\", \"precio\": 200000},\n",
    "    {\"id_actividad\": 6, \"nombre\": \"Alta Montaña\", \"tipo\": \"Aventura\", \"ciudad\": \"Mendoza\", \"precio\": 180000},\n",
    "    {\"id_actividad\": 7, \"nombre\": \"Cabalgata al atardecer en montaña\", \"tipo\": \"Aventura\", \"ciudad\": \"Menodoza\", \"precio\": 100000},\n",
    "    {\"id_actividad\": 8, \"nombre\": \"Ruta del Vino\", \"tipo\": \"gastronomico\", \"ciudad\": \"Mendoza\", \"precio\": 95000},\n",
    "    {\"id_actividad\": 9, \"nombre\": \"Cañon del Atuel\", \"tipo\": \"Aventura\", \"ciudad\": \"San Rafael\", \"precio\": 110000},\n",
    "    {\"id_actividad\": 10, \"nombre\": \"Tour Cataratas del Iguazu\", \"tipo\": \"Aventura\", \"ciudad\": \"Puerto Iguazu\", \"precio\": 200000},\n",
    "    {\"id_actividad\": 12, \"nombre\": \"Gran Aventura\", \"tipo\": \"Aventura\", \"ciudad\": \"Puerto Iguazu\", \"precio\": 150000},\n",
    "    {\"id_actividad\": 12, \"nombre\": \"Ruinas de San Ignacio\", \"tipo\": \"Cultural\", \"ciudad\": \"Puerto Iguazu\", \"precio\": 80000},\n",
    "    {\"id_actividad\": 14, \"nombre\": \"Bar de Hielo\", \"tipo\": \"Gastronomico\", \"ciudad\": \"Puerto Iguazy\", \"precio\": 60000},\n",
    "    {\"id_actividad\": 15, \"nombre\": \"Casita de Tucuman\", \"tipo\": \"Cultural\", \"ciudad\": \"San Miguel de Tucuman\", \"precio\": 40000},\n",
    "    {\"id_actividad\": 16, \"nombre\": \"City Tour Tucuman\", \"tipo\": \"Informativo\", \"ciudad\": \"San Miguel de Tucuman\", \"precio\": 50000},\n",
    "    {\"id_actividad\": 17, \"nombre\": \"Museo de Ciencias Naturales\", \"tipo\": \"Cultural\", \"ciudad\": \"La Plata\", \"precio\": 30000},\n",
    "    {\"id_actividad\": 18, \"nombre\": \"Paseo por Bosque de La Plata\", \"tipo\": \"Recreativo\", \"ciudad\": \"La Plata\", \"precio\": 20000},\n",
    "    {\"id_actividad\": 19, \"nombre\": \"Visita a Republica de los Niños\", \"tipo\": \"Recreativo\", \"ciudad\": \"La Plata\", \"precio\": 25000},\n",
    "    {\"id_actividad\": 20, \"nombre\": \"Museo Catedral\", \"tipo\": \"Cultural\", \"ciudad\": \"La Plata\", \"precio\": 30000},\n",
    "    {\"id_actividad\": 21, \"nombre\": \"Tour de Compras por Shopping Abasto\", \"tipo\": \"Bienestar\", \"ciudad\": \"Buenos Aires\", \"precio\": 40000},\n",
    "    {\"id_actividad\": 22, \"nombre\": \"Tour por la Casa Rosada\", \"tipo\": \"Cultural\", \"ciudad\": \"Buenos Aires\", \"precio\": 35000},\n",
    "    {\"id_actividad\": 23, \"nombre\": \"Paseo por Puerto Madero\", \"tipo\": \"Recreativo\", \"ciudad\": \"Buenos Aires\", \"precio\": 30000},\n",
    "    {\"id_actividad\": 24, \"nombre\": \"Recorrido por Catedral Metropolitana de Buenos Aires\", \"tipo\": \"Cultural\", \"ciudad\": \"Buenos Aires\", \"precio\": 25000},\n",
    "    {\"id_actividad\": 25, \"nombre\":  \"Excursion en barco para avistar ballenas\", \"tipo\": \"Aventura\", \"ciudad\": \"Puerto Madryn\", \"precio\": 120000},\n",
    "    {\"id_actividad\": 26, \"nombre\": \"City Tour por Puerto Madryn\", \"tipo\": \"Informativo\", \"ciudad\": \"Puerto Madryn\", \"precio\": 40000},\n",
    "    {\"id_actividad\": 27, \"nombre\": \"Circuito Chico y Campanario\", \"tipo\": \"Informativo\", \"ciudad\": \"Bariloche\", \"precio\": 80000},\n",
    "    {\"id_actividad\": 28, \"nombre\": \"Cerro Catedral\", \"tipo\": \"Aventura\", \"ciudad\": \"Bariloche\", \"precio\": 150000},\n",
    "    {\"id_actividad\": 29, \"nombre\": \"Paseo por el Centro de Bariloche\", \"tipo\": \"Recreativo\", \"ciudad\": \"Bariloche\", \"precio\": 30000},\n",
    "    {\"id_actividad\": 30, \"nombre\": \"Visita a Isla Victoria y Bosque de Arrayanes\", \"tipo\": \"Aventura\", \"ciudad\": \"Bariloche\", \"precio\": 110000},\n",
    "    {\"id_actividad\": 31, \"nombre\": \"Visita al Bolson y Lago Puelo\", \"tipo\": \"Aventura\", \"ciudad\": \"San Martin de los Andes\", \"precio\": 90000},\n",
    "    {\"id_actividad\": 33, \"nombre\": \"Ruta de los 7 Lagos\", \"tipo\": \"Aventura\", \"ciudad\": \"San Martin de los Andes\", \"precio\": 120000},\n",
    "    {\"id_actividad\": 34, \"nombre\": \"City Tour por Villa General Belgrano\", \"tipo\": \"Informativo\", \"ciudad\": \"Villa General Belgrano\", \"precio\": 40000},\n",
    "    {\"id_actividad\": 35, \"nombre\": \"City Tour por Cordoba\", \"tipo\": \"Informativo\", \"ciudad\": \"Cordoba\", \"precio\": 50000},\n",
    "    {\"id_actividad\": 37, \"nombre\": \"Tour dia completo en Valle Traslasierras\", \"tipo\": \"Aventura\", \"ciudad\": \"Cordoba\", \"precio\": 90000},\n",
    "    {\"id_actividad\": 39, \"nombre\": \"Salinas Grandes\", \"tipo\": \"Aventura\", \"ciudad\": \"Tilcara\", \"precio\": 80000},\n",
    "    {\"id_actividad\": 40, \"nombre\": \"Trekking Andino con Llamas\", \"tipo\": \"Treking\", \"ciudad\": \"Tilcara\", \"precio\": 60000},\n",
    "    {\"id_actividad\": 41, \"nombre\": \"Excursion a Purmamarca, Cerro de 7 colores y Quebrada de Humahuaca, \", \"tipo\": \"Aventura\", \"ciudad\": \"Tilcara\", \"precio\": 70000},\n",
    "    {\"id_actividad\": 42, \"nombre\": \"2 Horas en bicicleta por zona rural\", \"tipo\": \"Aventura\", \"ciudad\": \"Tilcara\", \"precio\": 30000},\n",
    "    {\"id_actividad\": 43, \"nombre\": \"Visitas a viñedos con degustacion\", \"tipo\": \"Gastronomico\", \"ciudad\": \"Tilcara\", \"precio\": 95000},\n",
    "    {\"id_actividad\": 44, \"nombre\": \"Caminata por la ciudad\", \"tipo\": \"Informativo\", \"ciudad\": \"Tilcara\", \"precio\": 40000},\n",
    "    {\"id_actividad\": 45, \"nombre\": \"City Tour por Bahia Blanca\", \"tipo\": \"Informativo\", \"ciudad\": \"Bahia Blanca\", \"precio\": 30000},\n",
    "    {\"id_actividad\": 46, \"nombre\": \"Playa Las Dunas\", \"tipo\": \"Recreativo\", \"ciudad\": \"Monte Hermoso\", \"precio\": 20000},\n",
    "    {\"id_actividad\": 47, \"nombre\": \"Reserva Natural Pehuen Co-Monte Hermoso\", \"tipo\": \"Recreativo\", \"ciudad\": \"Monte Hermoso\", \"precio\": 25000},\n",
    "    {\"id_actividad\": 48, \"nombre\": \"Museo de Ciencias Naturales Vicente Di Martino\", \"tipo\": \"Cultural\", \"ciudad\": \"Monte Hermoso\", \"precio\": 30000},\n",
    "    {\"id_actividad\": 50, \"nombre\": \"Paseo del Pinar\", \"tipo\": \"Recreativo\", \"ciudad\": \"Monte Hermoso\", \"precio\": 15000},\n",
    "    {\"id_actividad\": 51, \"nombre\": \"Laguna Sauce Grande\", \"tipo\": \"Recreativo\", \"ciudad\": \"San Rafael\", \"precio\": 20000} \n",
    "])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "afe3ca56",
   "metadata": {},
   "source": [
    "### Reservas:\n",
    "Usando MongoDB las definimos con un id_reserva, id_usuario, id_destino, fecha de reserva, estado (que puede ser: pendiente, confirmada, pagada o cancelada) y un precio total. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "b0a1aef2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "InsertManyResult([ObjectId('68f52bebbc856d8bff8f7299'), ObjectId('68f52bebbc856d8bff8f729a'), ObjectId('68f52bebbc856d8bff8f729b'), ObjectId('68f52bebbc856d8bff8f729c'), ObjectId('68f52bebbc856d8bff8f729d'), ObjectId('68f52bebbc856d8bff8f729e'), ObjectId('68f52bebbc856d8bff8f729f'), ObjectId('68f52bebbc856d8bff8f72a0'), ObjectId('68f52bebbc856d8bff8f72a1'), ObjectId('68f52bebbc856d8bff8f72a2'), ObjectId('68f52bebbc856d8bff8f72a3'), ObjectId('68f52bebbc856d8bff8f72a4'), ObjectId('68f52bebbc856d8bff8f72a5'), ObjectId('68f52bebbc856d8bff8f72a6'), ObjectId('68f52bebbc856d8bff8f72a7'), ObjectId('68f52bebbc856d8bff8f72a8'), ObjectId('68f52bebbc856d8bff8f72a9'), ObjectId('68f52bebbc856d8bff8f72aa'), ObjectId('68f52bebbc856d8bff8f72ab'), ObjectId('68f52bebbc856d8bff8f72ac'), ObjectId('68f52bebbc856d8bff8f72ad'), ObjectId('68f52bebbc856d8bff8f72ae'), ObjectId('68f52bebbc856d8bff8f72af'), ObjectId('68f52bebbc856d8bff8f72b0'), ObjectId('68f52bebbc856d8bff8f72b1'), ObjectId('68f52bebbc856d8bff8f72b2'), ObjectId('68f52bebbc856d8bff8f72b3'), ObjectId('68f52bebbc856d8bff8f72b4'), ObjectId('68f52bebbc856d8bff8f72b5'), ObjectId('68f52bebbc856d8bff8f72b6'), ObjectId('68f52bebbc856d8bff8f72b7'), ObjectId('68f52bebbc856d8bff8f72b8'), ObjectId('68f52bebbc856d8bff8f72b9'), ObjectId('68f52bebbc856d8bff8f72ba'), ObjectId('68f52bebbc856d8bff8f72bb'), ObjectId('68f52bebbc856d8bff8f72bc'), ObjectId('68f52bebbc856d8bff8f72bd'), ObjectId('68f52bebbc856d8bff8f72be'), ObjectId('68f52bebbc856d8bff8f72bf'), ObjectId('68f52bebbc856d8bff8f72c0'), ObjectId('68f52bebbc856d8bff8f72c1'), ObjectId('68f52bebbc856d8bff8f72c2')], acknowledged=True)"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.reservas.insert_many([\n",
    "    {\"id_reserva\": 1, \"id_usuario\": 1, \"id_destino\": 2, \"fecha_reserva\": \"2024-01-01\", \"estado\": \"Confirmada\", \"precio_total\": 200000},\n",
    "    {\"id_reserva\": 2, \"id_usuario\": 5, \"id_destino\": 9, \"fecha_reserva\": \"2024-01-15\", \"estado\": \"Cancelada\", \"precio_total\": 250000},\n",
    "    {\"id_reserva\": 3, \"id_usuario\": 3, \"id_destino\": 4, \"fecha_reserva\": \"2024-01-30\", \"estado\": \"Pagada\", \"precio_total\": 130000},\n",
    "    {\"id_reserva\": 4, \"id_usuario\": 2, \"id_destino\": 1, \"fecha_reserva\": \"2024-02-14\", \"estado\": \"Pendiente\", \"precio_total\": 100000},\n",
    "    {\"id_reserva\": 5, \"id_usuario\": 8, \"id_destino\": 3, \"fecha_reserva\": \"2024-02-27\", \"estado\": \"Confirmada\", \"precio_total\": 150000},\n",
    "    {\"id_reserva\": 6, \"id_usuario\": 4, \"id_destino\": 17, \"fecha_reserva\": \"2024-03-04\", \"estado\": \"Confirmada\", \"precio_total\": 120000},\n",
    "    {\"id_reserva\": 7, \"id_usuario\": 20, \"id_destino\": 3, \"fecha_reserva\": \"2024-03-19\", \"estado\": \"Cancelada\", \"precio_total\": 70000},\n",
    "    {\"id_reserva\": 8, \"id_usuario\": 15, \"id_destino\": 11, \"fecha_reserva\": \"2024-04-30\", \"estado\": \"Pagada\", \"precio_total\": 90000},\n",
    "    {\"id_reserva\": 9, \"id_usuario\": 10, \"id_destino\": 13, \"fecha_reserva\": \"2024-06-12\", \"estado\": \"Cancelada\", \"precio_total\": 150000},\n",
    "    {\"id_reserva\": 10, \"id_usuario\": 6, \"id_destino\": 19, \"fecha_reserva\": \"2024-07-11\", \"estado\": \"Pendiente\", \"precio_total\": 60000},\n",
    "    {\"id_reserva\": 11, \"id_usuario\": 13, \"id_destino\": 7, \"fecha_reserva\": \"2024-08-05\", \"estado\": \"Confirmada\", \"precio_total\": 300000},\n",
    "    {\"id_reserva\": 12, \"id_usuario\": 11, \"id_destino\": 16, \"fecha_reserva\": \"2024-09-24\", \"estado\": \"Pendiente\", \"precio_total\": 80000},\n",
    "    {\"id_reserva\": 13, \"id_usuario\": 18, \"id_destino\": 20, \"fecha_reserva\": \"2024-11-29\", \"estado\": \"Cancelada\", \"precio_total\": 70000},\n",
    "    {\"id_reserva\": 14, \"id_usuario\": 9, \"id_destino\": 15, \"fecha_reserva\": \"2024-12-10\", \"estado\": \"Pendiente\", \"precio_total\": 150000},\n",
    "    {\"id_reserva\": 15, \"id_usuario\": 7, \"id_destino\": 6, \"fecha_reserva\": \"2024-12-15\", \"estado\": \"Confirmada\", \"precio_total\": 80000},\n",
    "    {\"id_reserva\": 16, \"id_usuario\": 12, \"id_destino\": 14, \"fecha_reserva\": \"2024-12-20\", \"estado\": \"Cancelada\", \"precio_total\": 70000},\n",
    "    {\"id_reserva\": 17, \"id_usuario\": 16, \"id_destino\": 18, \"fecha_reserva\": \"2024-12-24\", \"estado\": \"Pagada\", \"precio_total\": 150000},\n",
    "    {\"id_reserva\": 18, \"id_usuario\": 8, \"id_destino\": 12, \"fecha_reserva\": \"2025-01-01\", \"estado\": \"Confirmada\", \"precio_total\": 120000},\n",
    "    {\"id_reserva\": 19, \"id_usuario\": 14, \"id_destino\": 10, \"fecha_reserva\": \"2025-01-02\", \"estado\": \"Cancelada\", \"precio_total\": 70000},\n",
    "    {\"id_reserva\": 20, \"id_usuario\": 19, \"id_destino\": 5, \"fecha_reserva\": \"2025-01-15\", \"estado\": \"Pagada\", \"precio_total\": 90000},\n",
    "    {\"id_reserva\": 21, \"id_usuario\": 17, \"id_destino\": 8, \"fecha_reserva\": \"2025-02-05\", \"estado\": \"Cancelada\", \"precio_total\": 150000},\n",
    "    {\"id_reserva\": 22, \"id_usuario\": 2, \"id_destino\": 4, \"fecha_reserva\": \"2025-02-20\", \"estado\": \"Pendiente\", \"precio_total\": 130000},\n",
    "    {\"id_reserva\": 23, \"id_usuario\": 5, \"id_destino\": 1, \"fecha_reserva\": \"2025-03-10\", \"estado\": \"Confirmada\", \"precio_total\": 100000},\n",
    "    {\"id_reserva\": 24, \"id_usuario\": 1, \"id_destino\": 2, \"fecha_reserva\": \"2025-03-25\", \"estado\": \"Pagada\", \"precio_total\": 200000},\n",
    "    {\"id_reserva\": 25, \"id_usuario\": 4, \"id_destino\": 9, \"fecha_reserva\": \"2025-04-15\", \"estado\": \"Cancelada\", \"precio_total\": 250000},\n",
    "    {\"id_reserva\": 26, \"id_usuario\": 3, \"id_destino\": 3, \"fecha_reserva\": \"2025-05-05\", \"estado\": \"Pendiente\", \"precio_total\": 150000},\n",
    "    {\"id_reserva\": 27, \"id_usuario\": 6, \"id_destino\": 7, \"fecha_reserva\": \"2025-05-20\", \"estado\": \"Confirmada\", \"precio_total\": 120000},\n",
    "    {\"id_reserva\": 28, \"id_usuario\": 9, \"id_destino\": 11, \"fecha_reserva\": \"2025-06-10\", \"estado\": \"Pagada\", \"precio_total\": 90000},\n",
    "    {\"id_reserva\": 29, \"id_usuario\": 12, \"id_destino\": 13, \"fecha_reserva\": \"2025-06-25\", \"estado\": \"Cancelada\", \"precio_total\": 150000},\n",
    "    {\"id_reserva\": 30, \"id_usuario\": 11, \"id_destino\": 15, \"fecha_reserva\": \"2025-07-15\", \"estado\": \"Pendiente\", \"precio_total\": 150000},\n",
    "    {\"id_reserva\": 31, \"id_usuario\": 14, \"id_destino\": 6, \"fecha_reserva\": \"2025-08-05\", \"estado\": \"Confirmada\", \"precio_total\": 80000},\n",
    "    {\"id_reserva\": 32, \"id_usuario\": 10, \"id_destino\": 5, \"fecha_reserva\": \"2025-08-20\", \"estado\": \"Cancelada\", \"precio_total\": 90000},\n",
    "    {\"id_reserva\": 33, \"id_usuario\": 15, \"id_destino\": 8, \"fecha_reserva\": \"2025-09-10\", \"estado\": \"Pagada\", \"precio_total\": 150000},\n",
    "    {\"id_reserva\": 34, \"id_usuario\": 18, \"id_destino\": 12, \"fecha_reserva\": \"2025-09-25\", \"estado\": \"Confirmada\", \"precio_total\": 120000},\n",
    "    {\"id_reserva\": 35, \"id_usuario\": 17, \"id_destino\": 10, \"fecha_reserva\": \"2025-10-15\", \"estado\": \"Cancelada\", \"precio_total\": 70000},\n",
    "    {\"id_reserva\": 36, \"id_usuario\": 20, \"id_destino\": 4, \"fecha_reserva\": \"2025-11-05\", \"estado\": \"Pendiente\", \"precio_total\": 130000},\n",
    "    {\"id_reserva\": 37, \"id_usuario\": 19, \"id_destino\": 1, \"fecha_reserva\": \"2025-11-20\", \"estado\": \"Confirmada\", \"precio_total\": 100000},\n",
    "    {\"id_reserva\": 38, \"id_usuario\": 16, \"id_destino\": 2, \"fecha_reserva\": \"2025-12-10\", \"estado\": \"Pagada\", \"precio_total\": 200000},\n",
    "    {\"id_reserva\": 39, \"id_usuario\": 8, \"id_destino\": 9, \"fecha_reserva\": \"2025-12-25\", \"estado\": \"Cancelada\", \"precio_total\": 250000},\n",
    "    {\"id_reserva\": 40, \"id_usuario\": 7, \"id_destino\": 3, \"fecha_reserva\": \"2026-01-15\", \"estado\": \"Pendiente\", \"precio_total\": 150000},\n",
    "    {\"id_reserva\": 41, \"id_usuario\": 13, \"id_destino\": 7, \"fecha_reserva\": \"2026-02-05\", \"estado\": \"Confirmada\", \"precio_total\": 120000},\n",
    "    {\"id_reserva\": 42, \"id_usuario\": 2, \"id_destino\": 11, \"fecha_reserva\": \"2026-02-20\", \"estado\": \"Pagada\", \"precio_total\": 90000}\n",
    "])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6d3aab2c",
   "metadata": {},
   "source": [
    "### Caché de búsquedas:\n",
    "Usando Redis definimos una clase \"Busqueda\" con los datos id del usuario y el id de: destino, actividad u hotel que buscó. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "1e471ee7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "r.hset (\"Busqueda:a\", mapping={\"id_usuario\": 1, \"id_destino\": 2})\n",
    "r.hset (\"Busqueda:b\", mapping={\"id_usuario\": 3, \"id_hotel\": 3})\n",
    "r.hset (\"Busqueda:c\", mapping={\"id_usuario\": 6, \"id_destino\": 5})\n",
    "r.hset(\"Busqueda:d\", mapping={\"id_usuario\": 15, \"id_actividad\": 2})\n",
    "r.hset(\"Busqueda:e\", mapping={\"id_usuario\": 18, \"id_destino\": 20})\n",
    "r.hset(\"Busqueda:f\", mapping={\"id_usuario\": 9, \"id_hotel\": 7})\n",
    "r.hset(\"Busqueda:g\", mapping={\"id_usuario\": 12, \"id_actividad\": 5})\n",
    "r.hset(\"Busqueda:h\", mapping={\"id_usuario\": 20, \"id_actividad\": 1})\n",
    "r.hset(\"Busqueda:i\", mapping={\"id_usuario\": 5, \"id_actividad\": 2})\n",
    "r.hset(\"Busqueda:j\", mapping={\"id_usuario\": 8, \"id_hotel\": 4})\n",
    "r.hset(\"Busqueda:k\", mapping={\"id_usuario\": 14, \"id_destino\": 8})\n",
    "r.hset(\"Busqueda:l\", mapping={\"id_usuario\": 11, \"id_hotel\": 2})\n",
    "r.hset(\"Busqueda:m\", mapping={\"id_usuario\": 8, \"id_actividad\": 35})\n",
    "r.hset(\"Busqueda:n\", mapping={\"id_usuario\": 4, \"id_destino\": 12})\n",
    "r.hset(\"Busqueda:o\", mapping={\"id_usuario\": 15, \"id_hotel\": 45})\n",
    "r.hset(\"Busqueda:p\", mapping={\"id_usuario\": 17, \"id_hotel\": 12})\n",
    "r.hset(\"Busqueda:q\", mapping={\"id_usuario\": 2, \"id_destino\": 27})\n",
    "r.hset(\"Busqueda:r\", mapping={\"id_usuario\": 8, \"id_actividad\": 4})\n",
    "r.hset(\"Busqueda:s\", mapping={\"id_usuario\": 19, \"id_hotel\": 33})\n",
    "r.hset(\"Busqueda:t\", mapping={\"id_usuario\": 16, \"id_destino\": 14})\n",
    "r.hset(\"Busqueda:u\", mapping={\"id_usuario\": 7, \"id_actividad\": 12})\n",
    "r.hset(\"Busqueda:v\", mapping={\"id_usuario\": 10, \"id_hotel\": 22})\n",
    "r.hset(\"Busqueda:w\", mapping={\"id_usuario\": 13, \"id_destino\": 6})\n",
    "r.hset(\"Busqueda:x\", mapping={\"id_usuario\": 1, \"id_actividad\": 3})\n",
    "r.hset(\"Busqueda:y\", mapping={\"id_usuario\": 6, \"id_hotel\": 11})"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fe957d9a",
   "metadata": {},
   "source": [
    "### Usuarios conectados:\n",
    "Usando Redis definimos una clase \"Usuario\" con los datos del id de usuario y el nombre del mismo. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "1cdff918",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "r.hset (\"Usuario:a\", mapping={\"id_usuario\": 1, \"nombre\": \"Lucrecia Martínez Pastur\"})\n",
    "r.hset (\"Usuario:b\", mapping={\"id_usuario\": 3, \"nombre\": \"Gregorio Gonzalez\"})\n",
    "r.hset (\"Usuario:c\", mapping={\"id_usuario\": 6, \"nombre\": \"Delfina Gomez\"})\n",
    "r.hset(\"Usuario:d\", mapping={\"id_usuario\": 13, \"nombre\": \"Lorenzo Torres\"})\n",
    "r.hset(\"Usuario:e\", mapping={\"id_usuario\": 16, \"nombre\": \"Martina Sanchez\"})"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4c7cccd9",
   "metadata": {},
   "source": [
    "### Reservas temporales:\n",
    "Usando Redis definimos una clase \"Reserva\" con los datos del id usuario e id destino. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "87402cdd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "r.hset (\"Reserva:a\", mapping={\"id_usuario\": 1, \"id_destino\": 20})\n",
    "r.hset (\"Reserva:b\", mapping={\"id_usuario\": 3, \"id_destino\": 15})\n",
    "r.hset (\"Reserva:c\", mapping={\"id_usuario\": 6, \"id_destino\": 3})\n",
    "r.hset (\"Reserva:d\", mapping={\"id_usuario\": 13, \"id_destino\": 8})\n",
    "r.hset (\"Reserva:e\", mapping={\"id_usuario\": 16, \"id_destino\": 11})"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6ccd5b12",
   "metadata": {},
   "source": [
    "### Relaciones entre usuarios y destinos:\n",
    "Usando Neo4j hicimos relaciones entre usuarios y destinos, que pueden ser: VISITO, RESERVO y BUSCO.  "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "0df5fb91",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7591862162d0>"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query_crear_destinos= \"\"\"\n",
    "    MERGE (a:Usuario {id_usuario: 1, nombre: \"Lucrecia Martínez Pastur\"})\n",
    "    MERGE (b:Usuario {id_usuario: 3, nombre: \"Gregorio Gonzalez\"})\n",
    "    MERGE (c:Usuario {id_usuario: 6, nombre: \"Delfina Gomez\"})\n",
    "    MERGE (d:Usuario {id_usuario: 13, nombre: \"Lorenzo Torres\"})\n",
    "    MERGE (e:Usuario {id_usuario: 16, nombre: \"Martina Sanchez\"})\n",
    "    MERGE (f:Usuario {id_usuario: 2, nombre: \"Rocio Coccaro\"}) \n",
    "    MERGE (g:Usuario {id_usuario: 15, nombre: \"Joaquin Ruiz\"})\n",
    "    MERGE (h:Usuario {id_usuario: 8, nombre: \"Catalina Romero\"})\n",
    "    MERGE (i:Usuario {id_usuario: 20, nombre: \"Sofia Hernandez\"})\n",
    "    MERGE (j:Usuario {id_usuario: 9, nombre: \"Benjamin Alvarez\"})\n",
    "    MERGE (k:Usuario {id_usuario: 14, nombre: \"Valentina Diaz\"})\n",
    "    MERGE (l:Usuario {id_usuario: 19, nombre: \"Juan Flores\"})\n",
    "    MERGE (m:Usuario {id_usuario: 4, nombre: \"Isabela Rodriguez\"})\n",
    "    MERGE (n:Usuario {id_usuario: 5, nombre: \"Conrado Maris\"})\n",
    "    MERGE (o:Usuario {id_usuario: 10, nombre: \"Olivia Lopez\"})\n",
    "    MERGE (p:Usuario {id_usuario: 12, nombre: \"Emilia Martinez\"})\n",
    "    MERGE (q:Usuario {id_usuario: 17, nombre: \"Santino Ramirez\"})\n",
    "    MERGE (r:Usuario {id_usuario: 7, nombre: \"Guillermo Juarez\"})\n",
    "    MERGE (s:Usuario {id_usuario: 11, nombre: \"Mateo Sosa\"})\n",
    "    MERGE (t:Usuario {id_usuario: 18, nombre: \"Catalina Romero\"})\n",
    "    \n",
    "    MERGE (a1:Destino {id_destino: 20, ciudad: \"Tilcara\"})\n",
    "    MERGE (a2:Destino {id_destino: 8, ciudad: \"Mendoza\"})\n",
    "    MERGE (a3:Destino {id_destino: 15, ciudad: \"Tandil\"})\n",
    "    MERGE (a4:Destino {id_destino: 17, ciudad: \"Gualeguaychu\"})\n",
    "    MERGE (a5:Destino {id_destino: 5, ciudad: \"Bariloche\"})\n",
    "    MERGE (a6:Destino {id_destino: 18, ciudad: \"Puerto Iguazu\"})\n",
    "    MERGE (a7:Destino {id_destino: 9, ciudad: \"Cordoba\"})\n",
    "    MERGE (a8:Destino {id_destino: 11, ciudad: \"Buenos Aires\"})\n",
    "    MERGE (a9:Destino {id_destino: 12, ciudad: \"La Plata\"})\n",
    "    MERGE (a10:Destino {id_destino: 7, ciudad: \"San Rafael\"})\n",
    "    MERGE (a11:Destino {id_destino: 3, ciudad: \"El Chalten\"})\n",
    "    MERGE (a12:Destino {id_destino: 4, ciudad: \"Puerto Madryn\"})\n",
    "    MERGE (a13:Destino {id_destino: 14, ciudad: \"Monte Hermoso\"})\n",
    "    MERGE (a14:Destino {id_destino: 16, ciudad: \"Bahia Blanca\"})\n",
    "    MERGE (a15:Destino {id_destino: 6, ciudad: \"San Martin de los Andes\"})\n",
    "    MERGE (a16:Destino {id_destino: 10, ciudad: \"Villa General Belgrano\"})\n",
    "    MERGE (a17:Destino {id_destino: 2, ciudad: \"Calafate\"})\n",
    "    MERGE (a18:Destino {id_destino: 1, ciudad: \"Ushuaia\"})\n",
    "    MERGE (a19:Destino {id_destino: 13, ciudad: \"Mar del Plata\"})\n",
    "    MERGE (a20:Destino {id_destino: 19, ciudad: \"San Miguel de Tucuman\"})\n",
    "    \n",
    "    MERGE (a)-[:VISITO]->(a1)\n",
    "    MERGE (c)-[:VISITO]->(a4)\n",
    "    MERGE (d)-[:RESERVO]->(a3)\n",
    "    MERGE (b)-[:RESERVO]->(a2)\n",
    "    MERGE (e)-[:BUSCO]->(a5)\n",
    "    MERGE (f)-[:VISITO]->(a6)\n",
    "    MERGE (g)-[:VISITO]->(a7)\n",
    "    MERGE (h)-[:RESERVO]->(a20)\n",
    "    MERGE (i)-[:VISITO]->(a15)\n",
    "    MERGE (t)-[:BUSCO]->(a8)\n",
    "    MERGE (s)-[:BUSCO]->(a9)\n",
    "    MERGE (j)-[:VISITO]->(a11)\n",
    "    MERGE (k)-[:VISITO]->(a19)\n",
    "    MERGE (l)-[:VISITO]->(a18)\n",
    "    MERGE (m)-[:VISITO]->(a7)\n",
    "    MERGE (n)-[:RESERVO]->(a9)\n",
    "    MERGE (o)-[:VISITO]->(a17)\n",
    "    MERGE (q)-[:RESERVO]->(a13)\n",
    "    MERGE (r)-[:BUSCO]->(a4)\n",
    "    MERGE (s)-[:VISITO]->(a4)\n",
    "    MERGE (a)-[:VISITO]->(a11)\n",
    "    MERGE (r)-[:VISITO]->(a19)\n",
    "    MERGE (l)-[:VISITO]->(a18)\n",
    "    MERGE (d)-[:VISITO]->(a8)\n",
    "    MERGE (o)-[:RESERVO]->(a1)\n",
    "    MERGE (c)-[:VISITO]->(a1)\n",
    "    MERGE (e)-[:VISITO]->(a15)\n",
    "    MERGE (a)-[:RESERVO]->(a14)\n",
    "    MERGE (m)-[:BUSCO]->(a6)\n",
    "    MERGE (r)-[:VISITO]->(a7)\n",
    "    MERGE (a)-[:VISITO]->(a20)\n",
    "    MERGE (c)-[:VISITO]->(a2)\n",
    "    MERGE (d)-[:VISITO]->(a5)\n",
    "    MERGE (r)-[:RESERVO]->(a3)\n",
    "    MERGE (s)-[:VISITO]->(a13)\n",
    "    MERGE (m)-[:VISITO]->(a12)\n",
    "    MERGE (k)-[:RESERVO]->(a18)\n",
    "    MERGE (h)-[:BUSCO]->(a9)\n",
    "    MERGE (f)-[:VISITO]->(a10)\n",
    "    MERGE (s)-[:VISITO]->(a2)\n",
    "    MERGE (i)-[:VISITO]->(a20)\n",
    "    MERGE (t)-[:RESERVO]->(a17)\n",
    "    MERGE (m)-[:BUSCO]->(a6)\n",
    "    MERGE (a)-[:VISITO]->(a7)\n",
    "    MERGE (p)-[:VISITO]->(a12)\n",
    "    MERGE (l)-[:VISITO]->(a11)\n",
    "    MERGE (f)-[:VISITO]->(a5)\n",
    "    MERGE (g)-[:RESERVO]->(a8)\n",
    "    MERGE (b)-[:VISITO]->(a10)\n",
    "    MERGE (c)-[:RESERVO]->(a9)\n",
    "    MERGE (j)-[:BUSCO]->(a12)\n",
    "    MERGE (a)-[:VISITO]->(a15)\n",
    "    MERGE (p)-[:VISITO]->(a18)    \n",
    "\"\"\"\n",
    "session.run(query_crear_destinos)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "620f3d4f",
   "metadata": {},
   "source": [
    "### Relaciones entre usuarios y usuarios:\n",
    "Usando Neo4j hicimos relaciones entre usuarios con otros usuarios, que pueden ser: AMIGO_DE, FAMILIAR_DE y CONOCIDO_DE. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "ded85725",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x75916eaebf10>"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query_crear_usuarios= \"\"\"\n",
    "    MERGE (a:Usuario {id_usuario: 5, nombre: \"Conrado Maris\"})\n",
    "    MERGE (b:Usuario {id_usuario: 18, nombre: \"Catalina Romero\"})\n",
    "    MERGE (c:Usuario {id_usuario: 14, nombre: \"Valentina Diaz\"})\n",
    "    MERGE (d:Usuario {id_usuario: 10, nombre: \"Olivia Lopez\"})\n",
    "    MERGE (e:Usuario {id_usuario: 2, nombre: \"Rocio Coccaro\"})\n",
    "    MERGE (f:Usuario {id_usuario: 7, nombre: \"Guillermo Juarez\"})\n",
    "    MERGE (g:Usuario {id_usuario: 19, nombre: \"Juan Flores\"})\n",
    "    MERGE (h:Usuario {id_usuario: 20, nombre: \"Sofia Hernandez\"})\n",
    "    MERGE (i:Usuario {id_usuario: 9, nombre: \"Benjamin Alvarez\"})\n",
    "    MERGE (j:Usuario {id_usuario: 11, nombre: \"Mateo Sosa\"})\n",
    "    MERGE (k:Usuario {id_usuario: 1, nombre: \"Lucrecia Martínez Pastur\"})\n",
    "    MERGE (l:Usuario {id_usuario: 4, nombre: \"Isabela Rodriguez\"})\n",
    "    MERGE (m:Usuario {id_usuario: 12, nombre: \"Emilia Martinez\"})\n",
    "    MERGE (n:Usuario {id_usuario: 13, nombre: \"Lorenzo Torres\"})\n",
    "    MERGE (o:Usuario {id_usuario: 6, nombre: \"Delfina Gomez\"})\n",
    "    MERGE (p:Usuario {id_usuario: 16, nombre: \"Martina Sanchez\"})\n",
    "    MERGE (q:Usuario {id_usuario: 17, nombre: \"Santino Ramirez\"})\n",
    "    MERGE (r:Usuario {id_usuario: 15, nombre: \"Joaquin Ruiz\"})\n",
    "    MERGE (s:Usuario {id_usuario: 8, nombre: \"Ema Fernandez!\"})\n",
    "    MERGE (t:Usuario {id_usuario: 3, nombre: \"Gregorio Gonzalez\"})\n",
    "    \n",
    "    MERGE (a)-[:AMIGO_DE]->(f)\n",
    "    MERGE(c)-[:FAMILIAR_DE]->(j)\n",
    "    MERGE(d)-[:AMIGO_DE]->(g)\n",
    "    MERGE(b)-[:CONOCIDO_DE]->(i)\n",
    "    MERGE(e)-[:FAMILIAR_DE]->(h)\n",
    "    MERGE (g)-[:AMIGO_DE]->(m)\n",
    "    MERGE(i)-[:FAMILIAR_DE]->(j)\n",
    "    MERGE(q)-[:AMIGO_DE]->(m)\n",
    "    MERGE(t)-[:CONOCIDO_DE]->(o)\n",
    "    MERGE(r)-[:FAMILIAR_DE]->(j)\n",
    "    MERGE (b)-[:AMIGO_DE]->(n)\n",
    "    MERGE(d)-[:FAMILIAR_DE]->(m)\n",
    "    MERGE(p)-[:AMIGO_DE]->(r)\n",
    "    MERGE(s)-[:CONOCIDO_DE]->(h)\n",
    "    MERGE(f)-[:FAMILIAR_DE]->(t)\n",
    "    MERGE (a)-[:AMIGO_DE]->(l)\n",
    "    MERGE(i)-[:FAMILIAR_DE]->(p)\n",
    "    MERGE(m)-[:AMIGO_DE]->(n)\n",
    "    MERGE(d)-[:CONOCIDO_DE]->(e)\n",
    "    MERGE(e)-[:FAMILIAR_DE]->(k)\n",
    "    MERGE (g)-[:AMIGO_DE]->(e)\n",
    "    MERGE (k)-[:AMIGO_DE]->(c)\n",
    "    MERGE (k)-[:AMIGO_DE]->(t)\n",
    " \n",
    "\"\"\"\n",
    "session.run(query_crear_usuarios)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f3e77d76",
   "metadata": {},
   "source": [
    "## **Se realizan consultas**"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "71b7d79b",
   "metadata": {},
   "source": [
    "* Mostrar los usuarios que visitaron Bariloche."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "07443f32",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Rocio Coccaro\n",
      "Lorenzo Torres\n"
     ]
    }
   ],
   "source": [
    "query_Bariloche=\"\"\"\n",
    "    MATCH (u:Usuario)-[:VISITO]->(d:Destino)\n",
    "    WHERE d.ciudad=\"Bariloche\"\n",
    "    RETURN u.nombre\n",
    "\"\"\"\n",
    "\n",
    "results_Bariloche=session.run(query_Bariloche)\n",
    "for record in results_Bariloche:\n",
    "    print(record[\"u.nombre\"])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c3f8b67d",
   "metadata": {},
   "source": [
    "* Mostrar los amigos de Juan que visitarion algún destino que visitó él, mostrar el nombre del usuario y el destino. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "96242caf",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Emilia Martinez , Ushuaia\n"
     ]
    }
   ],
   "source": [
    "query_Juan=\"\"\"\n",
    "    MATCH (j:Usuario {nombre: \"Juan Flores\"})-[:VISITO]->(d:Destino)\n",
    "    MATCH (j)-[:AMIGO_DE]->(a:Usuario)\n",
    "    MATCH (a)-[:VISITO]->(d)\n",
    "    RETURN a.nombre, d.ciudad\n",
    "\"\"\"\n",
    "\n",
    "results_Juan=session.run(query_Juan)\n",
    "for record in results_Juan:\n",
    "    print(record[\"a.nombre\"], \",\", record[\"d.ciudad\"])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "78f91c27",
   "metadata": {},
   "source": [
    "* Sugerir destinos a un usuario que no haya visitado el ni sus amigos. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "f2bfdde6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Mendoza\n",
      "Tandil\n",
      "Gualeguaychu\n",
      "Bariloche\n",
      "Puerto Iguazu\n",
      "Buenos Aires\n",
      "La Plata\n",
      "San Rafael\n",
      "Puerto Madryn\n",
      "Monte Hermoso\n",
      "Bahia Blanca\n",
      "Villa General Belgrano\n",
      "Calafate\n",
      "Ushuaia\n",
      "Mar del Plata\n"
     ]
    }
   ],
   "source": [
    "query_Lucrecia=\"\"\"\n",
    "    MATCH (l:Usuario {nombre: \"Lucrecia Martínez Pastur\"})\n",
    "    MATCH (d:Destino)\n",
    "    MATCH (u:Usuario)\n",
    "    WHERE NOT (l)-[:VISITO]->(d) AND NOT EXISTS ((l)-[:AMIGO_DE]->(u)-[:VISITO]->(d))\n",
    "    RETURN DISTINCT d.ciudad                \n",
    "\"\"\"\n",
    "\n",
    "results_Lucrecia=session.run(query_Lucrecia)\n",
    "for record in results_Lucrecia:\n",
    "    print(record[\"d.ciudad\"])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "356a0a84",
   "metadata": {},
   "source": [
    "* Recomendar destinos basados en viajes de amigos (destinos a los que hayan viajado tus amigos). "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "80e84ef0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "San Martin de los Andes\n",
      "San Miguel de Tucuman\n",
      "Cordoba\n",
      "San Miguel del Tucuman\n",
      "El Chalten\n",
      "Tilcara\n"
     ]
    }
   ],
   "source": [
    "query_amigos=\"\"\"\n",
    "    MATCH (g:Usuario {nombre: \"Gregorio Gonzalez\"})-[:AMIGO_DE]-(u:Usuario)-[:VISITO]->(d:Destino)\n",
    "    WHERE NOT (g)-[:VISITO]->(d)\n",
    "    RETURN DISTINCT d.ciudad\n",
    "\"\"\"\n",
    "\n",
    "results_amigos=session.run(query_amigos)\n",
    "for record in results_amigos:\n",
    "    print(record[\"d.ciudad\"])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e17df999",
   "metadata": {},
   "source": [
    "* Listar los hoteles en los destinos recomendados del punto anterior. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "059b4dfd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Los hoteles disponibles en San Martin de los Andes son:\n",
      "- Hotel & Spa La Cheminee\n",
      "- Amonite Apart & Spa\n",
      "- Hotel & Spa La Cheminee\n",
      "- Amonite Apart & Spa\n",
      "- Hotel & Spa La Cheminee\n",
      "- Amonite Apart & Spa\n",
      "- Hotel & Spa La Cheminee\n",
      "- Amonite Apart & Spa\n",
      "- Hotel & Spa La Cheminee\n",
      "- Amonite Apart & Spa\n",
      "Los hoteles disponibles en San Miguel de Tucuman son:\n",
      "- Hotel Carlos V\n",
      "- Hilton Garden Inn Tucuman\n",
      "- Hotel Carlos V\n",
      "- Hilton Garden Inn Tucuman\n",
      "- Hotel Carlos V\n",
      "- Hilton Garden Inn Tucuman\n",
      "- Hotel Carlos V\n",
      "- Hilton Garden Inn Tucuman\n",
      "- Hotel Carlos V\n",
      "- Hilton Garden Inn Tucuman\n",
      "Los hoteles disponibles en Cordoba son:\n",
      "- Hesperia Cordoba\n",
      "- Eurostars Palace\n",
      "- Hesperia Cordoba\n",
      "- Eurostars Palace\n",
      "- Hesperia Cordoba\n",
      "- Eurostars Palace\n",
      "- Hesperia Cordoba\n",
      "- Eurostars Palace\n",
      "- Hesperia Cordoba\n",
      "- Eurostars Palace\n",
      "Los hoteles disponibles en San Miguel del Tucuman son:\n",
      "Los hoteles disponibles en El Chalten son:\n",
      "- Chalten Suites Hotel\n",
      "- Chalten Suites Hotel\n",
      "- Chalten Suites Hotel\n",
      "- Chalten Suites Hotel\n",
      "- Chalten Suites Hotel\n",
      "Los hoteles disponibles en Tilcara son:\n",
      "- Balconcito de Tilcara\n",
      "- Hotel Belgrano\n",
      "- Vientonorte\n",
      "- Balconcito de Tilcara\n",
      "- Hotel Belgrano\n",
      "- Vientonorte\n",
      "- Balconcito de Tilcara\n",
      "- Hotel Belgrano\n",
      "- Vientonorte\n",
      "- Balconcito de Tilcara\n",
      "- Hotel Belgrano\n",
      "- Vientonorte\n",
      "- Balconcito de Tilcara\n",
      "- Hotel Belgrano\n",
      "- Vientonorte\n"
     ]
    }
   ],
   "source": [
    "results_amigos=session.run(query_amigos)\n",
    "for record in results_amigos:\n",
    "    hoteles= db.hoteles.find({\"ciudad\": record[\"d.ciudad\"]})\n",
    "    print(\"Los hoteles disponibles en\", record[\"d.ciudad\"], \"son:\")\n",
    "    for hotel in hoteles:\n",
    "        print(\"-\", hotel[\"nombre\"])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8351e7e2",
   "metadata": {},
   "source": [
    "* Ver las reservas en proceso, es decir que aún no están concretadas. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "f8e63a3d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'id_usuario': '6', 'id_destino': '3'}\n",
      "{'id_usuario': '1', 'id_destino': '20'}\n",
      "{'id_usuario': '16', 'id_destino': '11'}\n",
      "{'id_usuario': '3', 'id_destino': '15'}\n",
      "{'id_usuario': '13', 'id_destino': '8'}\n"
     ]
    }
   ],
   "source": [
    "reservas_claves=r.keys(\"Reserva:*\")\n",
    "for key in reservas_claves:\n",
    "    reserva=r.hgetall(key)\n",
    "    print(reserva)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f2e16b98",
   "metadata": {},
   "source": [
    "* Listar los usuarios conetcados actualmente. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "3d7e9df2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'id_usuario': '1', 'nombre': 'Lucrecia Martínez Pastur'}\n",
      "{'id_usuario': '6', 'nombre': 'Delfina Gomez'}\n",
      "{'id_usuario': '13', 'nombre': 'Lorenzo Torres'}\n",
      "{'id_usuario': '16', 'nombre': 'Martina Sanchez'}\n",
      "{'id_usuario': '3', 'nombre': 'Gregorio Gonzalez'}\n"
     ]
    }
   ],
   "source": [
    "usuarios_claves=r.keys(\"Usuario:*\")\n",
    "for key in usuarios_claves:\n",
    "    usuario=r.hgetall(key)\n",
    "    print(usuario)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3b169af1",
   "metadata": {},
   "source": [
    "* Mostrar los destinos con precio inferior a $100.000."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "e39f99e2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Destinos con precio inferior a $100.000:\n",
      "- Puerto Madrin\n",
      "- San Martin de los Andes\n",
      "- Mendoza\n",
      "- Buenos Aires\n",
      "- La Plata\n",
      "- Mar del Plata\n",
      "- Monte Hermoso\n",
      "- Bahía Blanca\n",
      "- Gualeguaychu\n",
      "- Puerto Iguazu\n",
      "- San Miguel de Tucuman\n",
      "- Tilcara\n",
      "- Puerto Madrin\n",
      "- San Martin de los Andes\n",
      "- Mendoza\n",
      "- Buenos Aires\n",
      "- La Plata\n",
      "- Mar del Plata\n",
      "- Monte Hermoso\n",
      "- Bahía Blanca\n",
      "- Gualeguaychu\n",
      "- Puerto Iguazu\n",
      "- San Miguel de Tucuman\n",
      "- Tilcara\n",
      "- Puerto Madrin\n",
      "- Buenos Aires\n",
      "- La Plata\n",
      "- Mar del Plata\n",
      "- Monte Hermoso\n",
      "- Bahía Blanca\n",
      "- Gualeguaychu\n",
      "- Puerto Iguazu\n",
      "- San Miguel de Tucuman\n",
      "- Puerto Madrin\n",
      "- Buenos Aires\n",
      "- La Plata\n",
      "- Mar del Plata\n",
      "- Monte Hermoso\n",
      "- Bahía Blanca\n",
      "- Gualeguaychu\n",
      "- Puerto Iguazu\n",
      "- San Miguel de Tucuman\n",
      "- Puerto Madrin\n",
      "- Buenos Aires\n",
      "- La Plata\n",
      "- Mar del Plata\n",
      "- Monte Hermoso\n",
      "- Bahía Blanca\n",
      "- Gualeguaychu\n",
      "- Puerto Iguazu\n",
      "- San Miguel de Tucuman\n"
     ]
    }
   ],
   "source": [
    "destinos_baratos_100000 = db.destinos.find({\"precio_promedio\": {\"$lt\": 100000}})\n",
    "print (\"Destinos con precio inferior a $100.000:\")\n",
    "for destino in destinos_baratos_100000:\n",
    "    print(f\"- {destino['ciudad']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bed4c7fa",
   "metadata": {},
   "source": [
    "* Mostrar todos los Hoteles de “Jujuy”."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "d0d8678d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Hoteles en Jujuy:\n",
      "- Balconcito de Tilcara en Tilcara\n",
      "- Hotel Belgrano en Tilcara\n",
      "- Vientonorte en Tilcara\n",
      "- Balconcito de Tilcara en Tilcara\n",
      "- Hotel Belgrano en Tilcara\n",
      "- Vientonorte en Tilcara\n",
      "- Balconcito de Tilcara en Tilcara\n",
      "- Hotel Belgrano en Tilcara\n",
      "- Vientonorte en Tilcara\n",
      "- Balconcito de Tilcara en Tilcara\n",
      "- Hotel Belgrano en Tilcara\n",
      "- Vientonorte en Tilcara\n",
      "- Balconcito de Tilcara en Tilcara\n",
      "- Hotel Belgrano en Tilcara\n",
      "- Vientonorte en Tilcara\n"
     ]
    }
   ],
   "source": [
    "hoteles_jujuy = db.hoteles.aggregate ([\n",
    "    {\n",
    "        \"$lookup\": {\n",
    "            \"from\": \"destinos\",\n",
    "            \"localField\": \"ciudad\",\n",
    "            \"foreignField\": \"ciudad\",\n",
    "            \"as\": \"hoteles_en_jujuy\"\n",
    "        }\n",
    "    },\n",
    "    {\n",
    "        \"$match\": {\n",
    "            \"hoteles_en_jujuy.provincia\": \"Jujuy\"\n",
    "        }\n",
    "    }\n",
    "])\n",
    "\n",
    "print(\"Hoteles en Jujuy:\")\n",
    "for hotel in hoteles_jujuy:\n",
    "        print(f\"- {hotel['nombre']} en {hotel['ciudad']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "48051ba1",
   "metadata": {},
   "source": [
    "* Mostrar la cantidad de hoteles de un destino que guste"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "e6efea88",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Cantidad de hoteles en Bariloche:\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "destino_elegido = db.hoteles.count_documents({\"ciudad\": \"Bariloche\"})\n",
    "print(\"Cantidad de hoteles en Bariloche:\")\n",
    "print(destino_elegido)\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1ca827f2",
   "metadata": {},
   "source": [
    "* Mostrar las actividades de “Ushuaia” del tipo “aventura”. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "15cc115b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Actividades de aventura en Ushuaia:\n",
      "- Navegacion a la pinguinera\n",
      "- Navegacion a la pinguinera\n",
      "- Navegacion a la pinguinera\n",
      "- Navegacion a la pinguinera\n"
     ]
    }
   ],
   "source": [
    "actividades_ushuaia = db.actividades.find({\"ciudad\": \"Ushuaia\", \"tipo\": \"Aventura\"})\n",
    "print(\"Actividades de aventura en Ushuaia:\")\n",
    "for actividad in actividades_ushuaia:\n",
    "    print (f\"- {actividad['nombre']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0e16acde",
   "metadata": {},
   "source": [
    "* Mostrar la cantidad de reservas concretadas de cada usuario. Mostrar el usuario y la cantidad"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "3d3c46bc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Usuario ID: 1, Total Reservas: 3\n",
      "Usuario ID: 2, Total Reservas: 3\n",
      "Usuario ID: 15, Total Reservas: 6\n",
      "Usuario ID: 19, Total Reservas: 3\n",
      "Usuario ID: 19, Total Reservas: 3\n",
      "Usuario ID: 18, Total Reservas: 3\n",
      "Usuario ID: 7, Total Reservas: 1\n",
      "Usuario ID: 14, Total Reservas: 3\n",
      "Usuario ID: 3, Total Reservas: 3\n",
      "Usuario ID: 8, Total Reservas: 6\n",
      "Usuario ID: 13, Total Reservas: 6\n",
      "Usuario ID: 1, Total Reservas: 3\n",
      "Usuario ID: 4, Total Reservas: 3\n",
      "Usuario ID: 5, Total Reservas: 3\n",
      "Usuario ID: 6, Total Reservas: 3\n",
      "Usuario ID: 9, Total Reservas: 3\n",
      "Usuario ID: 16, Total Reservas: 6\n"
     ]
    }
   ],
   "source": [
    "reservas_concretadas = db.reservas.aggregate ([\n",
    "    {\n",
    "        \"$match\": {\n",
    "            \"estado\": {\"$in\": [\"Confirmada\", \"Pagada\"]}\n",
    "        }},\n",
    "    {\"$group\": {\n",
    "            \"_id\": {\"usuario\": \"$id_usuario\",\"estado\": \"$estado\"},\n",
    "            \"total_reservas\": { \"$sum\": 1 }\n",
    "        }\n",
    "    }\n",
    "])\n",
    "\n",
    "for reservas in reservas_concretadas:\n",
    "    print(f\"Usuario ID: {reservas['_id']['usuario']}, Total Reservas: {reservas['total_reservas']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1b37e97c",
   "metadata": {},
   "source": [
    "# Estadisticas"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "80bbcfef",
   "metadata": {},
   "source": [
    "* Destino mas Visitado"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "fd1e822e",
   "metadata": {},
   "outputs": [],
   "source": [
    "query_masvisitado=\"\"\"\n",
    "    MATCH (u:Usuario)-[:VISITO]->(d:Destino)\n",
    "    WITH u, COUNT(d)\n",
    "    "
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.14"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
